"""
BM93 盛水最多的容器
https://www.nowcoder.com/practice/3d8d6a8e516e4633a2244d2934e5aa47

描述
给定一个数组 height，长度为 n，每个数代表坐标轴中的一个点的高度，height[i] 是在第 i 点的高度，
请问，从中选 2 个高度与 x 轴组成的容器最多能容纳多少水
1.你不能倾斜容器
2.当 n 小于 2 时，视为不能形成容器，请返回 0
3.数据保证能容纳最多的水不会超过整形范围，即不会超过 2^31-1

示例1
输入：[1,7,3,2,4,5,8,2,7]
返回值：49

示例2
输入：[2,2]
返回值：2

示例3
输入：[5,4,3,2,1,5]
返回值：25
"""

# 这道题利用了水桶的短板原理，较短的一边控制最大水量，因此直接用较短边长乘底部两边距离
# 就可以得到当前情况下的容积。但是要怎么找最大值呢？
#
# 可以利用贪心思想：容积与最短边长和底边长有关，与长的底边一定以首尾为边，但是首尾不一定够高，
# 中间可能会出现更高但是底边更短的情况，因此我们可以使用对撞双指针向中间靠，这样底边长会缩短，
# 因此还想要有更大容积只能是增加最短变长，此时我们每次指针移动就移动较短的一边，
# 因为贪心思想下较长的一边比较短的一边更可能出现更大容积。
#
# 优先舍弃较短的边:
#   if height[left] < height[right]:
#       left += 1
#   else:
#       right -= 1


def max_area(height):
    """
    双指针
    step 1：优先排除不能形成容器的特殊情况。
    step 2：初始化双指针指向数组首尾，每次利用上述公式(最短边长和底边长)计算当前的容积，维护一个最大容积作为返回值。
    step 3：对撞双指针向中间靠，但是依据贪心思想，每次指向较短边的指针向中间靠，另一指针不变。
    """
    if len(height) < 2:
        return 0

    res = 0
    left, right = 0, len(height) - 1
    while left <= right:
        if height[left] <= height[right]:
            res = max(res, height[left] * (right - left))
            left += 1
        else:
            res = max(res, height[right] * (right - left))
            right -= 1

    return res


if __name__ == "__main__":
    area = max_area([1, 7, 3, 2, 4, 5, 8, 2, 7])
    print(area)
