package main


/*
https://www.nowcoder.com/practice/445c44d982d04483b04a54f298796288?tpId=117&tqId=37781&rp=1&ru=/exam/oj&qru=/exam/oj&sourceUrl=%2Fexam%2Foj%3Ftab%3D%25E7%25AE%2597%25E6%25B3%2595%25E7%25AF%2587%26topicId%3D196&difficulty=undefined&judgeStatus=undefined&tags=583&title=

NC80 把二叉树打印成多行

给定一个节点数为 n 二叉树，要求从上到下按层打印二叉树的 val 值，同一层结点从左至右输出，每一层输出一行，将输出的结果存放到一个二维数组中返回。


该二叉树多行打印层序遍历的结果是
[
[1],
[2,3],
[4,5]
]

示例1
输入：
{1,2,3,#,#,4,5}
复制
返回值：
[[1],[2,3],[4,5]]
复制
示例2
输入：
{8,6,10,5,7,9,11}
复制
返回值：
[[8],[6,10],[5,7,9,11]]
复制
示例3
输入：
{1,2,3,4,5}
复制
返回值：
[[1],[2,3],[4,5]]
复制
示例4
输入：
{}
复制
返回值：
[]

*/