"""
BM65 最长公共子序列(二)  可以是非连续的，但是顺序要一致，要将[数据/字符串]保存下来
https://www.nowcoder.com/practice/6d29638c85bb4ffd80c020fe244baf11?tpId=295&tqId=991075

描述
给定两个字符串str1和str2，输出两个字符串的最长公共子序列。如果最长公共子序列为空，则返回"-1"。
目前给出的数据，仅仅会存在一个最长的公共子序列

示例1
输入："1A2C3D4B56","B1D23A456A"
返回值："123456"

示例2
输入："abc","def"
返回值："-1"
"""

# 二维数组
# dp方程，找规律， max
#
# 动态规划 + (递归)栈
# step 1：优先检查特殊情况。
# step 2：获取最长公共子序列的长度可以使用动态规划，我们以dp[i][j]表示在s1中以i结尾，s2中以j结尾的字符串的最长公共子序列长度。
# step 3：遍历两个字符串的所有位置，开始状态转移：若是i位与j位的字符相等，则该问题可以变成1+dp[i-1][j-1]。
# step 4：若是不相等，说明到此处为止的子串，最后一位不可能同时属于最长公共子序列，
#         因此我们考虑换成两个子问题，dp[i][j-1]或者dp[i-1][j]，我们取较大的一个就可以了。
# step 5：得到最长长度后，获取不需要第二个辅助数组b，直接从dp数组最后一位开始，
#         每次比较当前位置与其左、上、左上的关系，然后将符合要求的字符加入栈中，符合要求即来自dp表格左上方的字符。
# step 6：最后将栈中的字符拼接即可得到最长公共子序列，注意检查子序列是否为空。
#
# 时间复杂度：O(n^2)，最坏复杂度为构造辅助数组dp两层循环
# 空间复杂度：O(n^2)，辅助二维数组dp与栈空间最大为O(n^2)


# 跟背包问题，兑换零钱问题 是一类解决方案
# 和单词拆分 对比看看
def LCS2(s1, s2):
    if len(s2) == 0:
        return "-1"
    dp = [""] * len(s2)
    # 两个变量，分别用来保存符合条件的s1和s2的部分字符串
    t1 = ""
    for i in range(len(s1)):
        t1 = ""
        for j in range(len(s2)):
            t2 = dp[j]
            # 执行到最后，dp的最后一位是所有复合要求的字符
            # 字符相等，才添加
            # t1是之前相等的字符
            if s2[j] == s1[i]:
                dp[j] = t1 + s2[j]
            else:
                # 如果当前长度小于前一个长度，会将当前长度更新
                # j > 0 是因为有dp[j-1]
                # 字符不相等，后一个比前一个长度小，将后一个更新
                if j > 0 and len(dp[j]) < len(dp[j - 1]):
                    dp[j] = dp[j - 1]
            t1 = t2
    # 如果最后一位是空 == dp[len(dp) - 1]
    if dp[len(s2) - 1] == "":
        return "-1"
    # 返回最后一位
    return dp[len(s2) - 1]


if __name__ == "__main__":
    print(LCS2("1A2C3D4B56", "B1D23A456A"))
