"""
BM79 打家劫舍(二)  房间是圆形的
https://www.nowcoder.com/practice/a5c127769dd74a63ada7bff37d9c5815?tpId=295&tqId=2285837

描述
你是一个经验丰富的小偷，准备偷沿湖的一排房间，每个房间都存有一定的现金，为了防止被发现，
你不能偷相邻的两家。沿湖的房间组成一个闭合的圆形，即第一个房间和最后一个房间视为相邻。
给定一个长度为n的整数数组nums，数组中的元素表示每个房间存有的现金数额，
请你计算在不被发现的前提下最多的偷窃金额。

示例1
输入：[1,2,3,4]
返回值：6

示例2
输入：[1,3,6]
返回值：6
"""

# 第一家和最后一家不能同时取到
# 情况1：偷第一家的钱，不偷最后一家的钱。初始状态与状态转移不变，只是遍历的时候数组最后一位不去遍历。
# 情况2：偷最后一家的钱，不偷第一家的钱。初始状态就设定了dp[1]=0，第一家就不要了，然后遍历的时候也会遍历到数组最后一位。


# 加了一个限制条件，首位不能同时偷
# 偷第一家，不偷最后一家，控制点在于i < n,   dp[1] = nums[0]
# 不偷第一家，偷最后一家, 控制点在于i <= n， dp1[1] = 0
# 最终比较两种情况的大小
def rob1(nums):
    n = len(nums)
    # 偷第一家，不偷最后一家，控制点在于i < n， dp[1] = nums[0]
    # 因为下方 dp[i-1] 要保证有值，所以dp[1] 得有值，dp 长度设置为n + 1
    dp = [0] * (n + 1)
    dp[1] = nums[0]
    for i in range(2, n):
        # 偷(前一个不偷) 和 不偷(前一个被偷， 当前num[i-1]加上前一个偷的结果dp[i-2]) 比较下最大值
        dp[i] = max9(dp[i - 1], nums[i - 1] + dp[i - 2])
    # 偷第一家，不偷最后一家的最终结果
    res = dp[n - 1]

    # 不偷第一家，偷最后一家, 控制点在于i <= n， dp1[1] = 0
    dp1 = [0] * (n + 1)
    dp1[1] = 0
    for i in range(2, n + 1):
        # 不偷 和 偷（前一个数字num[i-1]加上前一个偷的结果dp[i-2]） 比较下最大值
        dp1[i] = max9(dp1[i - 1], nums[i - 1] + dp1[i - 2])
    # 不偷第一家，偷最后一家的最终结果
    res1 = dp1[n]
    # 比较两种情况的大小
    return max9(res, res1)


def max9(a, b):
    if a > b:
        return a
    return b


def main18():
    i = rob1([1, 2, 3, 4])
    print(i)


if __name__ == "__main__":
    main18()
